<template>
   <Teleport to="body">
      <Popup :is-active="isActive" @close-popup="closePopup">
         <div class="popup__header">
            <h2 class="popup__title">Политика конфиденциальности</h2>
         </div>
         <div class="popup__description content">
            <p>
               Пользователь, оставляя на сайте заявку на: бесплатную
               консультацию, обратный звонок, получение рекламной,
               рекламно-информационной и иной информации, подписку, участие в
               мероприятиях, акциях и розыгрышах, запись в лист ожидания/бронь,
               запись на приём или экскурсию/онлайн-тур, подписываясь на
               получение новостей, либо иным образом направляя свои персональные
               данные, принимает настоящее Согласие на обработку персональных
               данных, указанных в заявке (далее — Согласие).
            </p>
            <p>
               Действуя свободно, своей волей и в своем интересе, а также
               подтверждая свою дееспособность Пользователь дает свое согласие
               Обществу с ограниченной ответственностью Специализированный
               застройщик "СМ-Финанс" (ОГРН 1075260025268, ИНН 5260208112,
               почтовый адрес: 603105, Нижегородская область, г. Нижний
               Новгород, ул. Генкиной, д. 25А, помещение П52, кабинет 23, далее
               - «Администратор»), на обработку своих персональных данных в
               соответствии с Федеральным законом от 27.07.2006 N 152-ФЗ "О
               персональных данных".
            </p>
            <p>
               Под персональными данными понимаются данные, относящаяся к
               Пользователю как к субъекту персональных данных, не являющиеся
               специальными или биометрическими, такие как: фамилия, имя,
               отчество, дата и место рождения, пол, адрес, семейное положение,
               паспортные данные, адрес электронной почты, контактный номер
               телефона, а также все иные персональные данные, доступные либо
               известные в любой конкретный момент времени Администратору.
            </p>
            <p>
               Администратор также собирает следующие сведения об Устройстве,
               используемом Пользователем, с которого осуществляется
               использование сайта: IP-адрес и адрес точки подключения
               Пользователя, месторасположение Устройства, версия операционной
               системы и модель/тип Устройства, уникальный идентификатор
               Устройства; cookie-файлы; а также статистические данные о
               посещении и использовании сайта (время начала и завершения
               сессии, язык интерфейса, размер окна браузера и т.п.).
            </p>
         </div>
      </Popup>
   </Teleport>
</template>

<script setup>
defineProps({
   isActive: {
      type: Boolean,
      required: true,
   },
});
const emit = defineEmits(["closePopup"]);
const closePopup = () => {
   emit("closePopup");
};
</script>
