<template lang="pug">
	.article-page__content.content
		h2 {{ content.title }}
		.content__image.ibg
			div(v-html="content.field_image[0].markup")
			//- img(:src="`/images/articles/article-pic.jpg`" alt="Обслуживание и диагностика тормозной системы")
		.content-groups
			.content(v-html="content.body")
			//- .content-group
			//- 	.content-group__caption Тормозная система
			//- 	.content-group__text
			//- 		p Тормозная система - один из основных узлов автомобиля, отвечающий за безопасность пассажиров и имущества. Поломка тормоза может повлечь непоправимые последствиям. Именно поэтому нужно своевременно проводить обслуживание и диагностику системы.
			//- 		p В зависимости от условия окружающей среды или технического состояния автомобиля, эффективность тормозов может меняться.
			//- .content-group
			//- 	.content-group__caption Причины снижения эффективности тормозов
			//- 	ul
			//- 		li Колёсные покрышки с разной степенью сцепления с дорожным полотном. Рисунок протектора, его глубина и давление в шинах могут изменять длину тормозного пути.
						
			//- 		li Загруженность транспортного средства. Чем сильнее заполнен автомобиль, тем сложнее ему остановиться.
			//- 		li Износ и размягченность резиновых шлангов под капотом. При нажатии на педаль тормоза, давление жидкости в магистрали падает, эффективность работы тормозной системы снижается.
			//- 		li Неоптимальный угол схождения и развала способствует изменению траектории движения автомобиля при торможении.
			//- .content-group
			//- 	.content-group__caption Обслуживание тормозных систем
			//- 	.content-group__text
			//- 		p Каждый 10-15 тысяч километров пробега транспортного средства следует проводить некоторые работы по обслуживанию и диагностике системы тормозов. Нужно отрегулировать положение педали, силу стояночного тормоза, оценить степень износа колодок и заменить их, если они не пригодны к дальнейшей эксплуатации.
			//- 		p Также следует уделить внимание магистрали тормозной жидкости под капотом. Она не должна протекать. На трубках не должно быть деформаций или загрязнений. Деформированные участки магистрали следует заменить, а загрязнения очистить. Если цвет тормозной жидкости изменился – нужно залить новую. Резиновые участки магистрали проверяются на наличие трещин и потертостей. Изношенные шланги подлежат замене.
</template>

<script setup>
defineProps({
   content: {
      type: Object,
      required: true,
   },
});
</script>

<style lang="scss">
.article-page {
   &__content {
      max-width: 995px;
      & > h2 {
         margin-bottom: 60px;
         @media screen and (max-width: $xl) {
            margin-bottom: 40px;
         }
      }
   }
}
.content {
   &__image {
      padding-bottom: calc(540 / 995 * 100%);
   }
}
.content-groups {
   display: grid;
   gap: 40px;
   margin-top: 80px;
   & .content {
      & h2,
      h3,
      h4,
      h5,
      h6 {
         margin-bottom: 24px;
         margin-top: 40px;
      }
      & > *:first-child {
         margin-top: 0;
      }
      & > *:last-child {
         margin-bottom: 0;
      }
   }
   @media screen and (max-width: $xl) {
      margin-top: 40px;
   }
   @media screen and (max-width: $md) {
      gap: 30px;
   }
}
.content-group {
   &:nth-child(even) {
      & .content-group__caption {
         font-size: 20px;
         line-height: 28px;
      }
   }
   &__caption {
      font-weight: 600;
      font-size: 24px;
      line-height: 32px;
      color: $bg-white;
      margin-bottom: 24px;
   }
}
</style>
