<template lang="pug">
	div
		BreadCrumbs(:nav-list="blog.breadcrumbs")
		main.main
			.container
				.main-header
					.main-header__body
						h1.main__title.page-title {{blog.title}}
				.articles
					.articles__wrapper
						.articles__body
							ArticleCard(:article-list="blog.main.list")
						UiPager
</template>

<script setup>
useHead({
   title: "Блог",
});

const runtimeConfig = useRuntimeConfig();
const {
   data: blog,
   status,
   error,
} = await useAsyncData(
   "blog",
   () => $fetch(`${runtimeConfig.public.apiBase}/blog?_format=json`, {}),
   {
      transform: ({ breadcrumb, data, metatag }) => {
         console.log(data);
         return {
            breadcrumbs: breadcrumb,
            main: {
               list: data,
            },
            meta: metatag,
         };
      },
   }
);

const breadcrumbs = [
   {
      text: "Главная",
      href: "/",
   },
   {
      text: "Блог",
      href: "/blog",
   },
];
const articleList = [
   {
      id: "1",
      img: "article-1",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "2",
      img: "article-2",
      title: "Летние скидки на услуги автосервиса",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "3",
      img: "article-3",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "4",
      img: "article-1",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "5",
      img: "article-2",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "6",
      img: "article-3",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "7",
      img: "article-1",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "8",
      img: "article-2",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "9",
      img: "article-3",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "10",
      img: "article-1",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "11",
      img: "article-2",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
];
</script>

<style lang="scss">
.articles {
   &__wrapper {
      display: grid;
      grid-template-columns: 1fr;
      gap: 60px;
   }
   &__body {
      display: grid;
      grid-template-columns: repeat(3, 1fr);
      gap: 20px;
      @media screen and (max-width: $xxxl) {
         grid-template-columns: repeat(2, 1fr);
      }
      @media screen and (max-width: $md) {
         grid-template-columns: 1fr;
      }
   }
}
</style>
