<template>
   <BreadCrumbs :navList="breadcrumbs"></BreadCrumbs>
   <main class="main">
      <div class="main-header">
         <div class="container">
            <div class="main-header__body">
               <h1 class="main__title page-title">Блог</h1>
            </div>
         </div>
      </div>
      <div class="articles">
         <div class="container">
            <div class="articles__wrapper">
               <div class="articles__body">
                  <ArticleCard :articleList="articleList"></ArticleCard>
               </div>
               <UiPager />
            </div>
         </div>
      </div>
   </main>
</template>

<script setup>
useHead({
   title: "Блог",
});
const breadcrumbs = [
   {
      text: "Главная",
      href: "/",
   },
   {
      text: "Блог",
      href: "/blog",
   },
];
const articleList = [
   {
      id: "1",
      img: "article-1",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "2",
      img: "article-2",
      title: "Летние скидки на услуги автосервиса",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "3",
      img: "article-3",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "4",
      img: "article-1",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "5",
      img: "article-2",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "6",
      img: "article-3",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "7",
      img: "article-1",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "8",
      img: "article-2",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "9",
      img: "article-3",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "10",
      img: "article-1",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
   {
      id: "11",
      img: "article-2",
      title: "Обслуживание и диагностика тормозной системы",
      description:
         "Перевозкин24 имеет в своём распоряжении более 200 автомобилей ГАЗ, которые мы эксплуатируем и ремонтируем самостоятельно. Огромный опыт наших мастеров по ремонту автомобилей ГАЗ гарантирует высокое качество и надёжность.",
   },
];
</script>

<style lang="scss">
.articles {
   &__wrapper {
      display: grid;
      grid-template-columns: 1fr;
      gap: 60px;
   }
   &__body {
      display: grid;
      grid-template-columns: repeat(3, 1fr);
      gap: 20px;
      @media screen and (max-width: $xxxl) {
         grid-template-columns: repeat(2, 1fr);
      }
      @media screen and (max-width: $md) {
         grid-template-columns: 1fr;
      }
   }
}
</style>
