<template>
   <div class="service-card__description">
      <div class="container">
         <div class="heading">
            <div class="heading__title title-md">Описание услуги</div>
         </div>
         <div class="service-card__content content">
            <p>
               Каждый 10–15 тысяч километров пробега транспортного средства
               следует проводить некоторые работы по обслуживанию и диагностике
               системы тормозов. Нужно отрегулировать положение педали, силу
               стояночного тормоза, оценить степень износа колодок и заменить
               их, если они не пригодны к дальнейшей эксплуатации.
            </p>
            <p>
               Также следует уделить внимание магистрали тормозной жидкости под
               капотом. Она не должна протекать. На трубках не должно быть
               деформаций или загрязнений. Деформированные участки магистрали
               следует заменить, а загрязнения очистить. Если цвет тормозной
               жидкости изменился — нужно залить новую. Резиновые участки
               магистрали проверяются на наличие трещин и потёртостей.
               Изношенные шланги подлежат замене.
            </p>
            <p>
               Каждый 10–15 тысяч километров пробега транспортного средства
               следует проводить некоторые работы по обслуживанию и диагностике
               системы тормозов. Нужно отрегулировать положение педали, силу
               стояночного тормоза, оценить степень износа колодок и заменить
               их, если они не пригодны к дальнейшей эксплуатации.
            </p>
            <p>
               Также следует уделить внимание магистрали тормозной жидкости под
               капотом. Она не должна протекать. На трубках не должно быть
               деформаций или загрязнений. Деформированные участки магистрали
               следует заменить, а загрязнения очистить. Если цвет тормозной
               жидкости изменился — нужно залить новую. Резиновые участки
               магистрали проверяются на наличие трещин и потёртостей.
               Изношенные шланги подлежат замене.
            </p>
         </div>
      </div>
   </div>
</template>

<style lang="scss">
.service-card {
   &__description {
      padding: 80px 0;
      @media screen and (max-width: $xl) {
         padding: 40px 0;
      }
   }
   &__content {
      max-width: 1140px;
      margin-left: auto;
   }
}
</style>
